Repository: pwsafe/pwsafe
Catalog: Misc/I18N/ru/omegat_help/omegat/project_save.tmx
Source language: en_us
Languages: ru_ru

source: "A password policy determines how a password is created.
ru_ru: "Политика паролей определяет правила создания паролей.

source: "AaBbYyZz 0O1IlL"
ru_ru: «AaBbYyZzАаБбЖжЯя 0O1lIL»

source: "Account" becomes the entry's Title
ru_ru: «Account» — заголовок элемента.

source: "Attachment" - do NOT export this field as it can make the export file extremely large.
ru_ru: «Attachment» — не экспортируйте данное поле, т. к. это приводит значительному увеличению размера файла.

source: "Author of Applied Cryptography and other books, creator of the Blowfish algorithm, and founder and CTO of Counterpane Internet Security."
ru_ru: "Автор «Прикладной криптографии» («Applied Cryptography») и других книг, создатель алгоритма Blowfish, а также создатель и технический директор Counterpane Internet Security."

source: "Comments" becomes the entry's Notes
ru_ru: «Comments» — заметки.

source: "Creation Time" becomes the entry's creation time
ru_ru: «Creation Time» — время создания элемента.

source: "Creation Time: " becomes the entry's creation time
ru_ru: «Creation Time» — время создания элемента.

source: "Dummy Placeholder"
ru_ru: "Заглушка"

source: "Expires" becomes the entry's expiry date
ru_ru: «Expires» — дата истечения пароля.

source: "Expires: " becomes the entry's expiry date
ru_ru: «Expires» — дата истечения пароля.

source: "File → Import From...."
ru_ru: Файл→Импортировать из

source: "Group Tree" becomes the entry's group hierachy to the root
ru_ru: «Group Tree» — перечень родительских групп до корня.

source: "Group Tree" becomes the entry's group hierarchy to the root
ru_ru: «Group Tree» — перечень родительских групп до корня.

source: "Group Tree: " becomes the entry's group hierachy to the root
ru_ru: «Group Tree» — перечень родительских групп до корня.

source: "Group Tree: " becomes the entry's group hierarchy to the root
ru_ru: «Group Tree» — перечень родительских групп до корня.

source: "Group: " becomes the entry's Group
ru_ru: «Group» — группа элемента.

source: "In our terminology, the Combination is the password that you use to gain access to the Password Safe database."
ru_ru: "В нашей терминологии комбинация — пароль, позволяющий получить доступ к контейнеру Password Safe."

source: "Last Access" becomes the entry's last accessed time
ru_ru: «Last Access» — время последнего доступа к элементу.

source: "Last Access: " becomes the entry's last accessed time
ru_ru: «Last Access» — время последнего доступа к элементу.

source: "Last Modification" becomes the entry's password and the entry's last modification time
ru_ru: «Last Modification» — время изменения пароля и время последнего изменения.

source: "Last Modification: " becomes the entry's password and the entry's last modification time
ru_ru: «Last Modification» — время изменения пароля и время последнего изменения.

source: "Login Name" becomes the entry's User Name
ru_ru: «Login Name» — имя пользователя.

source: "Manage → Options → Misc." tab.
ru_ru: Управление→Настройки→Разное.

source: "Notes: " becomes the entry's Notes
ru_ru: «Notes» — заметки.

# "Only the following: 0 1 2 3 4 5 6 7 8 9 a b c d e f"
source: "Only the following:\n 0 1 2 3 4 5 6 7 8 9 a b c d e f"
ru_ru: "Только следующие:\n 0 1 2 3 4 5 6 7 8 9 a b c d e f"

source: "Password Groups" becomes the entry's Group
ru_ru: «Password Groups» — группа элемента.

source: "Password" becomes the entry's Password
ru_ru: «Password» — пароль.

source: "Password: " becomes the entry's Password
ru_ru: «Password» — пароль.

source: "Subviews" are predefined filters that when selected, show only the entries that match their criteria.
ru_ru: Здесь располагаются фильтры с некоторыми наперёд заданными условиями.

source: "Supported file formats: Version 1.x Password Safe database; tab-delimited text (.txt) files.
ru_ru: "Поддерживаемые форматы: контейнер Password Safe версии 1.x; текстовые файлы (.txt) с разделителем табуляция.

source: "URL: " becomes the entry's URL
ru_ru: «URL» — ссылка.

source: "UUID" becomes the internal unique ID of the Password Safe entry
ru_ru: «UUID» — уникальный идентификатор элемента.

source: "UUID: " becomes the internal unique ID of the Password Safe entry
ru_ru: «UUID» — уникальный идентификатор элемента.

source: "User Name: " becomes the entry's User Name
ru_ru: «User Name» — имя пользователя.

source: "Web Site" becomes the entry's URL
ru_ru: «Web Site» — ссылка.

source: "\{+Tab}" is equivalent to "Shift+Tab"
ru_ru: «\{+Tab}» соответствует «Shift+Tab»

source: "\{+^Tab}" is equivalent to "Ctrl+Shift+Tab"
ru_ru: «\{+^Tab}» соответствует «Ctrl+Shift+Tab»

source: "\{^Home}" is equivalent to "Control+Home".
ru_ru: «\{^Home}» соответствует «Control+Home».

source: $a(value)
ru_ru: $a(значение)

source: ${a}(value)
ru_ru: ${a}(значение)

source: '#' - This is the row number.
ru_ru: «#» — номер условия.

source: '+' - Click on this to insert a new row below a given row.
ru_ru: «+» — щелчок по данному полю добавляет новую строку после текущей.

source: '-' - Click on this to delete the current row.
ru_ru: «-» — щелчок по этому полю приводит к удалению текущей строки.

source: '?' - The checkbox in this column determines if the row is active or not.
ru_ru: «?» — флажок в данном столбце определяет, используется данное условие или нет.

source: 'And/Or' - This allows you to determine the relation of the rule you're adding to the previous rule.
ru_ru: «И / Или» — позволяет определить связь с предыдущим условием.

source: 'Browse to URL' copies password to clipboard
ru_ru: «Перейти по ссылке» копирует пароль в буфер обмена

source: 'Criteria' - Define the value you're interested in for the selected field.
ru_ru: «Условие» — описывает условие, накладываемое на выбранное поле.

source: 'Field' - Select the entry field you're interested in, e.g., username, title, group, notes, etc.
ru_ru: «Поле» — содержит имя поля на которое накладывается условие («Имя пользователя», «Пароль», «Заголовок», «Группа», и пр.).

source: 'Redo' the last 'undone' action.
ru_ru: Повторить последнее отменённое действие

source: 'Undo' the last action.
ru_ru: Отменить последнее действие

source: 'ffffnnnllluuudddsss' means in detail:
ru_ru: расшифровка «ffffnnnllluuudddsss»:

source: 'undo' the last action.
ru_ru: Отменить последнее действие

source: (This is stored as a decimal integer created from the virtual keycode for the character in the lower word plus the Microsoft Foundation Class CHotKeyCtrl modifier flags in the higher word.)
ru_ru: (Хранится как десятичное целое: в младшем слове содержится виртуальный код символа, в старшем — флаги CHotKeyCtrl [Microsoft Foundation Class])

source: -1: Use the database default
ru_ru: -1 — действие по умолчанию;

source: -1: Default
ru_ru: -1 — действие по умолчанию;

source: 0 = Black, 1 - Blue, 2 = White and 3 = Yellow
ru_ru: 0 — Чёрный, 1 — Голубой, 2 — Белый, 3 — Жёлтый

source: 0% means normal fully opaque and 100% is totally transparent and invisible.
ru_ru: 0 % — нормальный вид (полностью непрозрачно), 100 % — невидимо (полностью прозрачно).

source: 002 : use at least 2 uppercase characters
ru_ru: 002 — не менее 2 прописных букв;

source: 003 : use at least 3 symbol characters
ru_ru: 003 — не менее 3 символов.

source: 004 : use at least 4 lowercase characters
ru_ru: 004 — не менее 4 строчных букв;

source: 005 : use at least 5 digit characters
ru_ru: 005 — не менее 5 цифр;

source: 010 : use at least 16 (dec) characters
ru_ru: 010 — минимальная длина пароля 16 символов (в десятичной системе счисления);

source: 0: Copy password to clipboard
ru_ru: 0 — копировать пароль в буфер обмена;

source: 0x01FF: not used
ru_ru: 0x01FF — не используется.

source: 0x0200: use pronounceable password characters
ru_ru: 0x0200 — создавать произносимые пароли;

source: 0x0400: use EasyVision password characters
ru_ru: 0x0400 — использовать удобочитаемые символы;

source: 0x0800: use hex only (0-9,a-f) characters (if set, then no other flags can be set)
ru_ru: 0x0800 — использовать только шестнадцатеричные (0–9,a–f) символы (если указан данный флаг, остальные не должны быть установлены);

source: 0x1000: use symbols
ru_ru: 0x1000 — использовать символы;

source: 0x2000: use digits
ru_ru: 0x2000 — использовать цифры;

source: 0x4000: use upper case characters
ru_ru: 0x4000 — использовать прописные буквы;

source: 0x8000: use lower case characters
ru_ru: 0x8000 — использовать строчные буквы;

source: 1 hexadecimal digit - status for saving PWH for this entry (0 = no; 1 = yes)
ru_ru: 1 шестнадцатеричная цифра — ведение истории паролей для данного элемента (0 = нет; 1 = да);

source: 1 hexadecimal digit status for saving PWH for this entry (0 = no; 1 = yes)
ru_ru: 1 шестнадцатеричная цифра — наличие сохранённой истории паролей для данного элемента (0 = нет; 1 = есть);

source: 1. All entries with a username containing "joe" or "Joe" or "JOE":
ru_ru: 1. Все элементы, с именем пользователя «вася», «Вася» или «ВАСЯ»:

source: 1: View/Edit selected entry
ru_ru: 1 — просмотр/редактирование элемента;

source: 2 hexadecimal digits - maximum number of entries in this entry
ru_ru: 2 шестнадцатеричные цифры — максимальное количество элементов истории для данного элемента;

source: 2 hexadecimal digits - number of entries currently saved
ru_ru: 2 шестнадцатеричные цифры — количество сохранённых паролей в истории.

source: 2 hexadecimal digits maximum number of entries in this entry
ru_ru: 2 шестнадцатеричные цифры — максимальное количество элементов истории для данного элемента;

source: 2 hexadecimal digits number of entries currently saved
ru_ru: 2 шестнадцатеричные цифры — количество сохранённых паролей в истории.

source: 2: AutoType
ru_ru: 2 — автонабор;

source: 2: Autotype
ru_ru: 2 — автонабор;

source: 3: Browse to URL
ru_ru: 3 — перейти по ссылке;

source: 4 hexadecimal digits - length of old password
ru_ru: 4 шестнадцатеричные цифры — длина пароля в данном элементе;

source: 4 hexadecimal digits length of old password
ru_ru: 4 шестнадцатеричные цифры — длина пароля в данном элементе;

source: 4: Copy notes to clipboard
ru_ru: 4 — копировать заметки в буфер обмена;

source: 5: Copy username to clipboard
ru_ru: 5 — копировать имя пользователя в буфер;

source: 6 hexadecimal values are contained in this format.
ru_ru: Это поле содержит 6 шестнадцатеричных чисел.

source: 6: Copy password to clipboard, minimize
ru_ru: 6 — копировать пароль в буфер обмена и свернуть;

source: 7: Browse to URL + AutoType
ru_ru: 7 — перейти по ссылке и выполнить автонабор;

source: 7: Browse to URL + Autotype
ru_ru: 7 — перейти по ссылке и выполнить автонабор;

source: 8 hexadecimal digits - time oldpassword was set
ru_ru: 8 шестнадцатеричных цифр — время помещения пароля в историю;

source: 8 hexadecimal digits time oldpassword was set
ru_ru: 8 шестнадцатеричных цифр — время помещения пароля в историю;

source: 8: Run Command
ru_ru: 8 — выполнить команду;

source: 9: Send email
ru_ru: 9 — отправить письмо.

source: : The Export of sensitive information from a Password Safe database to a text file has serious security consequences.
ru_ru: Экспорт важной информации из контейнера Password Safe в текстовый файл может привести к серьёзным последствиям, связанным с безопасностью.

source: This will start the application "silently", that is, minimized and with no database (unless one is specified).
ru_ru: Приложение будет запущено «молча» — в свёрнутом виде и без контейнера (если он не указан в параметрах).

source: This will start the application closed, that is, with no database, and without the initial opening dialog (To access a database, use the File menu).
ru_ru: В данном случае приложение будет запущено без контейнера, в том числе не будет выведен стандартный диалог (для открытия контейнера можно использовать меню «Файл»).

source: This is a deliberate design decision, since any mechanism for retrieving lost passwords poses a security hole that can be exploited.
ru_ru: Это осознанное решение разработчиков, так как любой механизм восстановления потерянных паролей является брешью в системе защиты и может быть использован злоумышленниками.

source: tab in the Options dialog box.
ru_ru: в окне «Настройки».

source: <String> <Key>Title</Key> <Value>Test title</Value> </String>
ru_ru: <String> <Key>Title</Key> <Value>Заголовок элемента</Value> </String>

source: Password Safe Forum: A forum for questions, support, and problems.
ru_ru: Форум Password Safe: форум для вопросов, технической поддержки и разрешения проблем.

source: Password Safe News: RSS feeds available for this project.
ru_ru: Новости Password Safe: RSS-каналы о данном проекте.

source: The email address is according to the standard rules (per RFC 2368):
ru_ru: Адрес электронной почты обрабатывается согласно правилам, указанным в RFC 2368.

source: Backups Tab
ru_ru: «Резервные копии»

source: Development Team: Just some of the folks that have helped develop and keep Password Safe going.
ru_ru: Коллектив разработчиков: лишь некоторые из тех, кто помог при разработке Password Safe, и поддерживает его развитие.

source: If you wish, you can enter your own password into the password field manually, or you can have Password Safe generate a new one based on the current Password Policy.
ru_ru: Вы можете ввести пароль вручную, или создать его в соответствии с установленной политикой паролей.

source: Password Safe Home Page: Information and news about Password Safe as well as announcements about project status and new releases.
ru_ru: Домашняя страница Password Safe: информация и новости о Password Safe, анонсы новых версий и текущий статус проекта.

source: YubiKey is an innovative hardware authentication device developed and sold by Yubico.
ru_ru: YubiKey это инновационное устройство аутентификации разработанное и продаваемое корпорацией Yubico.

source: Password History Tab
ru_ru: «История паролей»

source: Security Tab
ru_ru: «Безопасность»

source: Shortcuts Tab System Tab
ru_ru: «Комбинации клавиш» Вкладка «Система»

source: Shortcuts Tab
ru_ru: «Комбинации клавиш»

source: Misc Tab
ru_ru: «Разное»

source: System Tab
ru_ru: «Система»

source: Display Tab
ru_ru: «Вид»

source: Password Policy Tab
ru_ru: «Политика создания паролей»

source: -g config_file
ru_ru: -g файл_настроек

source: -h hostname
ru_ru: -h имя_хоста

source: -u username
ru_ru: -u имя_пользователя

source: Additional: additional specifications, including history
ru_ru: Дополнительно: дополнительные характеристики, включая историю паролей

source: Basic: all necesarry elements for password management
ru_ru: Основные: все необходимые элементы, связанные с управлением паролями

source: Basic: all necessary elements for password management
ru_ru: Основные: все необходимые элементы, связанные с управлением паролями

source: Dates and Times: expiry and statistics
ru_ru: Дата и время: дата истечения пароля и статистика

source: Password Policy: specific differences to the default
ru_ru: Политика создания паролей: переопределяет для данного элемента «политику по умолчанию»

source: Warning: The Export of sensitive information from a Password Safe database to a text file has serious security consequences. This operation will create an unprotected copy of the passwords in the database. Deleting this copy after use is not sufficient and other actions should be taken to properly erase the data (e.g. third party “shredding” utilities). The export of sensitive data effectively bypasses the security of the Password Safe program.
ru_ru: Внимание! Экспорт в текстовый формат важной информации может привести к проблемам с безопасностью. Данная операция создаёт незащищённую копию паролей из контейнера. Простого удаления данной копии недостаточно, и требуется использование дополнительных утилит для гарантированного удаления данных. Экспорт важной информации позволяет обойти меры защиты, предоставляемые Password Safe.

source: Warning: The Export of sensitive information from a Password Safe database to a text file has serious security consequences.
ru_ru: Внимание! Экспорт важной информации из контейнера Password Safe в текстовый файл может привести к серьёзным последствиям, связанным с безопасностью.

source: IMPORTANT: The first line of the file being imported must be a tab-separated list of the names of the fields that each entry contains, e.g., "Group/Title Username Password URL", etc.
ru_ru: Внимание! Первая строка импортируемого файла должна содержать список имён столбцов, разделённых табуляцией.

source: There is no mechanism within Password Safe to retrieve lost or forgotten safe passwords.
ru_ru: В Password Safe не существует механизма для восстановления потерянных (забытых) мастер-паролей.

source: Note 1. Time fields can be one of the following 5 formats:
ru_ru: Примечание 1. Время может быть указано в одном из пяти форматов.

source: Note 1. Time fields can be one of the following 7 formats:
ru_ru: Примечание 1. Время может быть указано в одном из семи форматов.

source: Note 2. Password history is represented in the exported entry record as a text field comprising a header followed by the required number of entries of old passwords:
ru_ru: Примечание 2. История паролей состоит из заголовка, описывающего элементы истории и требуемого количества записей о старых паролях.

source: Note 3. The Password Policy is represented in the exported entry record as a text field 'ffffnnnllluuudddsss' in hexadecimal format, e.g. 'F000010004002005003'.
ru_ru: Примечание 3. Политика создания паролей экспортируется как текстовое поле «ffffnnnllluuudddsss» в шестнадцатеричном формате, например, «F000010004002005003».

source: Note 4. The following values for Double Click Action are availble:
ru_ru: Примечание 4. Допустимы следующие значения для действия по двойному клику:

source: Notes: 1 Time fields can be one of the following 5 formats:
ru_ru: Примечание. 1 Время может быть указано в одном из 5 форматов:

source: Notes: 2 Password history is represented in the exported entry record as a text field comprising a header followed by the required number of entries of old passwords:
ru_ru: Примечание. 2 История паролей состоит из заголовка, описывающего элементы истории и требуемого количества записей о старых паролях:

source: Notes: 3 The Password Policy is represented in the exported entry record as a text field 'ffffnnnllluuudddsss' in hexadecimal format, e.g. 'F000010004002005003'.
ru_ru: Примечание. 3 Политика создания паролей экспортируется как текстовое поле «ffffnnnllluuudddsss» в шестнадцатеричном формате, например, «F000010004002005003».

source: Notes: 4 The following values for Double Click Action are availble:
ru_ru: Примечание. 4 Допустимы следующие значения для действия по двойному клику:

source: Auto Type provides a means for users to easily and quickly enter user name and password information.
ru_ru: Автонабор предназначен для ускорения и упрощения ввода имени пользователя и пароля.

source: AutoType: If this field is not empty, then its content replaces the default value for the AutoType function (which is dislayed above and comes from either the Password Safe default or this database's default as set via the "Manage → Options → Misc." tab).
ru_ru: Автонабор: если поле не пусто, его содержимое заменяет на параметры автонабора, установленные по умолчанию (значение по умолчанию указано сверху и берётся из настроек Password Safe для текущего контейнера, задаваемых на вкладке Управление→Настройки→Разное).

source: AutoType: If this field is not empty, then its content replaces the default value for the AutoType function (which is displayed above and comes from either the Password Safe default or this database's default as set via the "Manage → Options → Misc." tab).
ru_ru: Автонабор: если поле не пусто, его содержимое заменяет на параметры автонабора, установленные по умолчанию (значение по умолчанию указано сверху и берётся из настроек Password Safe для текущего контейнера, задаваемых на вкладке Сервис→Настройки→Разное).

source: AutoType provides a means for users to easily and quickly enter user name and password information.
ru_ru: Автонабор предназначен для ускорения и упрощения ввода имени пользователя и пароля.

source: AutoType provides a means for you to easily and quickly enter user name and password information.
ru_ru: Автонабор предназначен для ускорения и упрощения ввода имени пользователя и пароля.

source: Autotype: If this field is not empty, the its content replaces the default value for the autotype function (which is dislayed above and comes from either the Password Safe default or this database's default as set via the "Manage → Options → Misc." tab).
ru_ru: Автонабор: если поле не пусто, его содержимое заменяет на параметры автонабора, установленные по умолчанию (значение по умолчанию указано сверху и берётся из настроек Password Safe для текущего контейнера, задаваемых на вкладке Управление→Настройки→Разное).

source: Autotype: If this field is not empty, the its content replaces the default value for the autotype function.
ru_ru: Автонабор: если поле не пусто, его содержимое заменяет параметры автонабора, установленные по умолчанию.

source: Ctrl -T or right-click and select Perform Auto Type or click on the Toolbar button to initiate.
ru_ru: Для выполнения автонабора нажмите Ctrl-T (также можно щёлкнуть правой кнопкой мыши и выбрать в контекстном меню Автонабор или нажать соответствующую кнопку на панели инструментов).

source: Ctrl+T or right-click and select Perform Auto Type or click on the Toolbar button to initiate.
ru_ru: Для выполнения автонабора нажмите Ctrl+T (также можно щёлкнуть правой кнопкой мыши и выбрать в контекстном меню Автонабор или нажать соответствующую кнопку на панели инструментов).

source: Ctrl+T or right-click and select Perform AutoType or click on the Toolbar button to initiate.
ru_ru: Для выполнения автонабора нажмите Ctrl+T (также можно щёлкнуть правой кнопкой мыши и выбрать в контекстном меню Автонабор или нажать соответствующую кнопку на панели инструментов).

source: Default AutoType Delay This is the amount of time, in milli-seconds, that PasswordSafe waits between characters when performing the autotype.
ru_ru: Задержка между символами Определяет время ожидания (в миллисекундах) перед автонабором следующего символа в последовательности.

source: Default AutoType String Here you can specify the AutoType string to use by default for all entries.
ru_ru: Строка автонабора по умолчанию Здесь можно указать строку автонабора, применяемую по умолчанию.

source: Default Autotype String Here you can specify the autotype string to use by default for all entries.
ru_ru: Строка автонабора по умолчанию Здесь можно указать строку автонабора, применяемую по умолчанию.

source: Do not click on the Generate button.
ru_ru: Не нажимайте на кнопку «Создать».

source: Double click and Shift-Double click on entry: This allows you to define what action Password Safe will take when you double-click, or double-click with Shift depressed, on an entry.
ru_ru: Действие по двойному клику и действие по Shift+двойной клик: задаёт действие, которое Password Safe выполнит при двойном щелчке на элементе или при двойном щелчке на элементе с нажато клавишей Shift.

source: Double click on entry: This allows you to define what action Password Safe will take when you double-click on an entry.
ru_ru: Действие по двойному клику: задаёт действие, которое Password Safe выполнит при двойном щелчке на элементе.

source: Double click on entry: This allows you to define what action PasswordSafe will take when you double-click on an entry.
ru_ru: Действие по двойному клику: задаёт действие, которое Password Safe выполнит при двойном щелчке на элементе.
